IDEA StatiCa Open Model
OpeningRect Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The OpeningRect type exposes the following members.
Properties
Name | Description
GeomId
 Id representing geometrical parts of Detail
 (Inherited from Opening.)
Height
 Height of wall
Id
 Element Id
 (Inherited from OpenElementId.)
InsertPoint
 Insert point 0 - 9
 (Inherited from Opening.)
MasterComponent
 Master component
 (Inherited from Opening.)
MasterPoint
 Master point 0 - 9
 (Inherited from Opening.)
Name
 Name
 (Inherited from Opening.)
Outline
 Outline of Oopening
 (Inherited from Opening.)
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
 (Inherited from Opening.)
Width
 Width of wall
Top
See Also
Reference
OpeningRect Class
IdeaRS.OpenModel.Detail Namespace